---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewAnalysisResultsVisibility
source: html/4a19254f-e7e6-580d-a01d-47b428b2b818.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewAnalysisResultsVisibility Property

"Analysis Display Settings"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewAnalysisResultsVisibility { get; }
```